Public Attributes | List of all members
API_ExportIdMappingType Struct Reference
Analytical Model
Describes the connection between the unsegmented surface member's and the created segment's edges and vertices. More...
#include <APIdefs_AnalyticalModel.h>
 Public Attributes
API_ExportMappingTable  | edges
The mapping between edges and the segment edges.
API_ExportMappingTable  | vertices
The mapping between vertices and the segment vertices.
Detailed Description
Describes the connection between the unsegmented surface member's and the created segment's edges and vertices.
Since
Archicad 24
Member Data Documentation
◆ edges
 API_ExportIdMappingType::edges
The mapping between edges and the segment edges.
◆ vertices
 API_ExportIdMappingType::vertices
The mapping between vertices and the segment vertices.